app/controllers/conferences_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `conference_users` WHERE (`conference_users`.`user_id` = 2) AND (`conference_users`.conference_id = 1) LIMIT 1
SELECT `conferences`.* FROM `conferences` INNER JOIN `conference_users` ON `conferences`.id = `conference_users`.conference_id WHERE ((`conference_users`.user_id = 1))
INSERT INTO `conferences` (`created_at`, `initiator_id`, `title`, `updated_at`) VALUES('2010-04-29 16:35:21', 1, NULL, '2010-04-29 16:35:21')
INSERT INTO `conference_users` (`created_at`, `recomender_id`, `updated_at`, `terminated_at`, `user_id`, `status`, `conference_id`, `last_read_at`, `terminator_id`) VALUES('2010-04-29 16:35:21', NULL, '2010-04-29 16:35:21', NULL, 1, 0, 2, NULL, NULL)
---
  def new
    conferences = current_user.conferences
    #contact = Contact.find(params[:contact_id])
    user = User.find(params[:user_id])
    @conference = nil
    for conference in conferences
      if conference.conference_users.size == 2 and conference.conference_users.find_by_user_id(user.id)
        @conference = conference
        break
      end
    end

    if @conference.nil?
      @conference = current_user.initiated_conferences.create
      @conference.users << current_user

SELECT * FROM `conferences` WHERE (`conferences`.`id` = 1)
---
  def show
    @conference = Conference.find(params[:id])