app/controllers/conferences_controller.rb

  def new
    conferences = current_user.conferences
    contact = Contact.find(params[:contact_id])
---
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1)