app/controllers/messages_controller.rb

SELECT * FROM `conferences` WHERE (`conferences`.`id` = 1)
INSERT INTO `messages` (`created_at`, `updated_at`, `text`, `sender_id`, `conference_id`) VALUES('2010-04-28 17:28:44', '2010-04-28 17:28:44', 'test123', 1, 1)
---
  def create
    @conference = Conference.find(params[:conference_id])
    @message = @conference.messages.new(params[:message])
    current_user.sent_messages << @message