app/controllers/users_controller.rb

  def search
    if params[:search_string]
      search_string = '%' + params[:search_string] + '%'
      @users = User.find(:all, :conditions=>["not id = ? and (login like ? or email like ?)", current_user.id, search_string, search_string])
---
SELECT * FROM `users` WHERE (not id = 1 and (login like '%%' or email like '%%'))